# UndoOff

## Description
Procedure UndoOff clears the undo table and suspends undo for the remainder of the VectorScript procedure. The undo system resumes after the procedure is completed.

```pascal
PROCEDURE UndoOff;
```

```python

def vs.UndoOff():
    return None
```

## Version
Availability: from VectorWorks8.0
## Category
* Utility